In [34]:
import pandas as pd

df = pd.read_excel('score.xlsx',index_col='지원번호')
df.sort_index(inplace=True)
df

df.to_csv('score.csv',encoding='utf-8-sig')
df.to_csv('score.txt',encoding='utf-8')
df.to_excel('score.xlsx')

In [4]:
df.columns # 모든 컬럼을 보여줌.

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

In [10]:
# int, float타입의 개수, 평균, 분산,..등 대략적인 통계 값을 보여줌.
df.describe()
df.count() #해당하는 키값들의 value개수

이름      8
학교      8
키       8
국어      8
영어      8
수학      8
과학      8
사회      8
SW특기    6
dtype: int64

In [8]:
df['키'].describe()

count      8.000000
mean     189.250000
std       10.039209
min      168.000000
25%      187.750000
50%      189.000000
75%      194.750000
max      202.000000
Name: 키, dtype: float64

In [11]:
# 각 컬럼별 평균, 최댓값, 최솟값 등 통계 출력
df['키'].mean()
df['키'].count()
df['키'].max()
df['키'].min()
df['키'].count()

8

In [20]:
df = pd.read_csv('stu_score1.csv',encoding='utf-8')
df

       no        id  kor  eng  math  total        avg  rank      c_date
0       1   Joelynn   55   87    68    210  70.000000     0  2024-04-04
1       2    Bambie   73   69    77    219  73.000000     0  2024-04-01
2       3      Orin   92   97    90    279  93.000000     0  2024-04-04
3       4      Puff   98   60    78    236  78.666667     0  2024-04-04
4       5   Godfree   66   72    59    197  65.666667     0  2024-04-06
..    ...       ...  ...  ...   ...    ...        ...   ...         ...
995   996   Wilburt   59   64    51    174  58.000000     0  2024-04-01
996   997   Broddie   89   53    54    196  65.333333     0  2024-04-06
997   998    Baxter   63   82    78    223  74.333333     0  2024-04-02
998   999   Ignacio   61   60    96    217  72.333333     0  2024-04-07
999  1000  Wallache   83   64    56    203  67.666667     0  2024-04-08

[1000 rows x 9 columns]

In [13]:
df.head(10) # 위에서 10개 가져오고 싶을 때
df.tail(10) # 아래서 10개 가져오고 싶을 때

   no        id  kor  eng  math  total        avg  rank      c_date
0   1   Joelynn   55   87    68    210  70.000000     0  2024-04-04
1   2    Bambie   73   69    77    219  73.000000     0  2024-04-01
2   3      Orin   92   97    90    279  93.000000     0  2024-04-04
3   4      Puff   98   60    78    236  78.666667     0  2024-04-04
4   5   Godfree   66   72    59    197  65.666667     0  2024-04-06
5   6     Penny   64   66    63    193  64.333333     0  2024-04-08
6   7     Matti   84   81    97    262  87.333333     0  2024-04-02
7   8  Catherin   58   69    95    222  74.000000     0  2024-04-02
8   9     Flora   95   58    72    225  75.000000     0  2024-04-03
9  10    Rhodia   60   97    72    229  76.333333     0  2024-04-09

In [15]:
# rows, column 개수를 보여줌
df.shape

(1000, 9)

In [18]:
# 각각의 rows 데이터들을 배열로 생성
df.values
df.values[0:5]

array([[1, 'Joelynn', 55, 87, 68, 210, 70.0, 0, '2024-04-04'],
       [2, 'Bambie', 73, 69, 77, 219, 73.0, 0, '2024-04-01'],
       [3, 'Orin', 92, 97, 90, 279, 93.0, 0, '2024-04-04'],
       [4, 'Puff', 98, 60, 78, 236, 78.66666667, 0, '2024-04-04'],
       [5, 'Godfree', 66, 72, 59, 197, 65.66666667, 0, '2024-04-06']],
      dtype=object)

In [21]:
df.index # index 출력

RangeIndex(start=0, stop=1000, step=1)

In [23]:
df.columns # 모든 컬럼 출력

Index(['no', 'id', 'kor', 'eng', 'math', 'total', 'avg', 'rank', 'c_date'], dtype='object')

In [27]:
df = pd.read_excel('score.xlsx',index_col='지원번호')
df

       이름   학교    키   국어  영어   수학   과학  사회        SW특기
지원번호
8번    송근열  단지고  190   72  55   49   76  59          c#
7번    박혜정  단지고  188  100  99   86   84  86      PYTHON
6번    박동현  단지고  202   83  86   28   95  58           C
5번    김재욱  구로고  188   75  38   99  100  96         NaN
4번    김수찬  구로고  187   88  93   84   28  57         NaN
3번    강호림  구로고  168   60  77   56   88  93  Javascript
2번    강태원  구로고  194   50  63   88   49  58        Java
1번    강나래  구로고  197   90  85  100   95  84      Python

In [29]:
df['이름']

지원번호
8번    송근열
7번    박혜정
6번    박동현
5번    김재욱
4번    김수찬
3번    강호림
2번    강태원
1번    강나래
Name: 이름, dtype: object

In [33]:
df.columns # 모든 컬럼명 출력
df.columns[0] # 이름
df['이름'] # 인덱스 + 이름(데이터표 모양으로)
df[df.columns[0]] # df['이름'] 같음
df[df.columns[-1]] # 마지막 컬럼의 데이터

지원번호
8번            c#
7번        PYTHON
6번             C
5번           NaN
4번           NaN
3번    Javascript
2번          Java
1번        Python
Name: SW특기, dtype: object

### 데이터확인

In [36]:
df.describe()  # 컬럼별 대략적 정보: min,max,mean..
df.head()      # 상단 5개 출력(개수 조절 가능)
df.tail()      # 하단 5개 출력
df.info()      # 컬럼별 타입,크기 정보
df.values      # rows 데이터 배열로 출력
df.index       # index 정보
df.columns     # 컬럼 정보
df.shape       # 데이터 크기 정보 (8,9) : 행 8개, 열 9개

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 1번 to 8번
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      8 non-null      object
 1   학교      8 non-null      object
 2   키       8 non-null      int64
 3   국어      8 non-null      int64
 4   영어      8 non-null      int64
 5   수학      8 non-null      int64
 6   과학      8 non-null      int64
 7   사회      8 non-null      int64
 8   SW특기    6 non-null      object
dtypes: int64(6), object(3)
memory usage: 640.0+ bytes

(8, 9)

In [37]:
df.shape
df.shape[0] # 행 개수(index 수)
df.shape[1] # 열 개수(컬럼 수)

8